Revit 2022 API
ParameterUtils.GetBuiltInParameter Method
 Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")]
public static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId parameterTypeId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")> _
Public Shared Function GetBuiltInParameter ( _
	parameterTypeId As ForgeTypeId _
) As BuiltInParameter
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")]
public:
static BuiltInParameter GetBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
Parameters
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
The parameter identifier.
Return Value
The BuiltInParameter value corresponding to the given parameter identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  parameterTypeId is not a built-in parameter identifier. See IsBuiltInParameter(ForgeTypeId) and GetParameterTypeId(BuiltInParameter).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace